kayrozen/knob-radio/firmware/s3_sender/sdkconfig.defaults
# ESP32-S3 sender defaults.

CONFIG_IDF_TARGET="esp32s3"

# --- Flash & partitions (N16R8 module: 16 MB flash) ---
# The default 1 MB app partition can't hold the Phase E ESP-ADF + WiFi binary
# (~1.2 MB), so use a custom table with a 3 MB factory app. See partitions.csv.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM (8 MB on the R8 module; needed by the ADF pipeline in Phase E) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- Performance ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- LVGL UI fonts (Phase E, optional UI) ---
# The preset screen uses Montserrat 12/20 in addition to the default 14. These
# symbols come from the lvgl managed component; enabling them is a no-op for
# builds that don't link the UI.
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_20=y

# --- LVGL image decoder for album art (Phase 9) ---
# Decodes the downloaded station-logo JPEG for the cover tile (album_art.c).
CONFIG_LV_USE_SJPG=y

# --- TLS cert bundle (Phase 9: HTTPS favicon download) ---
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# --- FreeRTOS ---
# ESP-ADF's audio_pipeline (Phase E) still uses legacy FreeRTOS names
# (xSemaphoreHandle, portTICK_RATE_MS) that IDF v5.x only exposes with the
# backward-compatibility option. ADF's own examples set it; the TONE build
# is unaffected by the extra legacy definitions.
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
